
export const START_DATE = new Date('2024-09-07T00:00:00');

export const HEART_MESSAGE = `我喜欢你，始于你那些真实可爱的瞬间：你的坦率直白，你那一丁点可爱的小脾气，还有你遇见惊喜时眼角眉梢流露出的笑意。这些真实，让我觉得生活充满了色彩。

但让我彻底沦陷的，是你带给我的力量。你接纳了我的脆弱，修补了我的敏感，让我相信自己值得被爱，也值得更自信。

比起那些转瞬即逝的喧嚣，我更眷恋这种细水长流的笃定。在不断靠近你的过程中，那个答案在我心里越来越清晰——

并不是因为合适才选择，而是因为是你，我才做出了这个坚定不移的选择。`;

export const SOUL_TRAITS = [
  "喜欢你工作时那股不服输的劲儿。",
  "喜欢你总是能敏锐察觉到别人情绪的细腻。",
  "喜欢你虽然不开心，却从不隐藏，总能准确表达出自己情绪的真诚。",
  "喜欢你在决定一件事后，那种专注且坚定的眼神。"
];

export const SIGNAL_MESSAGES = [
  "收到信号。别怕，我在。现在的首要任务是深呼吸。回家再说，天塌了我顶着。",
  "信号已确认。抱抱正在加载中... 请相信，所有的阴霾都会过去，我就在这里。",
  "圣诞节世间都在庆祝，而我在想庆祝‘你在我身边’。我想一直站在你身边陪着你. Merry Christmas, I'm always here with you.",
  "无论发生什么，我永远是你最坚实的后盾。放松，我们一起面对。"
];
